backend/controllers/SiteController.php

SELECT COUNT(*) FROM `user` WHERE `status`=10
---
    public function actionIndex()
    {
        $usersTotais = User::find()->where(['status' => User::STATUS_ACTIVE])->count();