backend/controllers/UserdataController.php

SELECT * FROM `userdata` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Userdata::findOne(['id' => $id])) !== null) {