backend/controllers/UserdataController.php

SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=2)
SELECT * FROM `user` WHERE `id`=2
---
    public function actionDelete($id)
    {
        $userData = $this->findModel($id);
        $model = User::findOne($userData->user_id);

SELECT * FROM `userdata` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Userdata::findOne(['id' => $id])) !== null) {