common/models/User.php

    public function getName() {
        $userData = Userdata::find()->where(['id_user' => $this->getId()])->one();
---
SELECT * FROM `userdata` WHERE `id_user`=2