common/models/User.php

    public function getName() {
        $userData = Userdata::find()->where(['user_id' => $this->getId()])->one();
---
SELECT * FROM `userdata` WHERE `user_id`=5