frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();

        $userCreated = $user->save();

        $userData = new Userdata();
        $userData->firstName = $this->firstName;
        $userData->lastName = $this->lastName;
        $userData->telemovel = $this->telemovel;
        $userData->morada = $this->morada;
        $userData->user_id = $user->id;

        $userDataCreated = $userData->save();
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `status`, `created_at`, `updated_at`) VALUES ('cliente2', 'cliente2@gmail.com', '$2y$13$vUxcG0l/gh64.bFTPqwR6OAhuNsGNEj4nqflIk0Qiu4E3Lr6rgaLG', 'M2G28nbtdqTQ6nYIx3064njeS9P0YiyV', 'p2_iqTkwb26pv5U-XvF8hbebZMpbfdHA_1668445622', 10, 1668445622, 1668445622)
INSERT INTO `userdata` (`firstName`, `lastName`, `telemovel`, `morada`, `user_id`) VALUES ('cliente', 'cliente', 912123321, 'xpto', 7)